{
  "_name_or_path": "indian_food_image_detection",
  "architectures": [
    "ViTForImageClassification"
  ],
  "attention_probs_dropout_prob": 0.0,
  "encoder_stride": 16,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_size": 768,
  "id2label": {
    "0": "Apple",
    "1": "Banana",
    "2": "Mango",
    "3": "Orange",
    "4": "Pear",
    "5": "Strawberry",
    "6": "Tomato",
    "7": "Watermelon",
    "8": "adhirasam",
    "9": "aloo_gobi",
    "10": "aloo_matar",
    "11": "aloo_methi",
    "12": "aloo_shimla_mirch",
    "13": "aloo_tikki",
    "14": "anarsa",
    "15": "bandar_laddu",
    "16": "basundi",
    "17": "bhatura",
    "18": "bhindi_masala",
    "19": "biryani",
    "20": "boondi",
    "21": "butter_chicken",
    "22": "chak_hao_kheer",
    "23": "cham_cham",
    "24": "chana_masala",
    "25": "chapati",
    "26": "chhena_kheeri",
    "27": "chicken_razala",
    "28": "chicken_tikka",
    "29": "chicken_tikka_masala",
    "30": "chikki",
    "31": "daal_baati_churma",
    "32": "daal_puri",
    "33": "dal_makhani",
    "34": "dal_tadka",
    "35": "dum_aloo",
    "36": "gajar_ka_halwa",
    "37": "gavvalu",
    "38": "ghevar",
    "39": "gulab_jamun",
    "40": "imarti",
    "41": "jalebi",
    "42": "kachori",
    "43": "kadai_paneer",
    "44": "kadhi_pakoda",
    "45": "kajjikaya",
    "46": "kakinada_khaja",
    "47": "kalakand",
    "48": "karela_bharta",
    "49": "kofta",
    "50": "lassi",
    "51": "litti_chokha",
    "52": "lyangcha",
    "53": "makki_di_roti_sarson_da_saag",
    "54": "malapua",
    "55": "misi_roti",
    "56": "misti_doi",
    "57": "modak",
    "58": "mysore_pak",
    "59": "naan",
    "60": "navrattan_korma",
    "61": "palak_paneer",
    "62": "paneer_butter_masala",
    "63": "phirni",
    "64": "pithe",
    "65": "poha",
    "66": "poornalu",
    "67": "pootharekulu",
    "68": "qubani_ka_meetha",
    "69": "rabri",
    "70": "ras_malai",
    "71": "rasgulla",
    "72": "sandesh",
    "73": "shankarpali",
    "74": "sheer_korma",
    "75": "sheera",
    "76": "shrikhand",
    "77": "sohan_halwa",
    "78": "sohan_papdi",
    "79": "sutar_feni"
  },
  "image_size": 224,
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "Apple": 0,
    "Banana": 1,
    "Mango": 2,
    "Orange": 3,
    "Pear": 4,
    "Strawberry": 5,
    "Tomato": 6,
    "Watermelon": 7,
    "adhirasam": 8,
    "aloo_gobi": 9,
    "aloo_matar": 10,
    "aloo_methi": 11,
    "aloo_shimla_mirch": 12,
    "aloo_tikki": 13,
    "anarsa": 14,
    "bandar_laddu": 15,
    "basundi": 16,
    "bhatura": 17,
    "bhindi_masala": 18,
    "biryani": 19,
    "boondi": 20,
    "butter_chicken": 21,
    "chak_hao_kheer": 22,
    "cham_cham": 23,
    "chana_masala": 24,
    "chapati": 25,
    "chhena_kheeri": 26,
    "chicken_razala": 27,
    "chicken_tikka": 28,
    "chicken_tikka_masala": 29,
    "chikki": 30,
    "daal_baati_churma": 31,
    "daal_puri": 32,
    "dal_makhani": 33,
    "dal_tadka": 34,
    "dum_aloo": 35,
    "gajar_ka_halwa": 36,
    "gavvalu": 37,
    "ghevar": 38,
    "gulab_jamun": 39,
    "imarti": 40,
    "jalebi": 41,
    "kachori": 42,
    "kadai_paneer": 43,
    "kadhi_pakoda": 44,
    "kajjikaya": 45,
    "kakinada_khaja": 46,
    "kalakand": 47,
    "karela_bharta": 48,
    "kofta": 49,
    "lassi": 50,
    "litti_chokha": 51,
    "lyangcha": 52,
    "makki_di_roti_sarson_da_saag": 53,
    "malapua": 54,
    "misi_roti": 55,
    "misti_doi": 56,
    "modak": 57,
    "mysore_pak": 58,
    "naan": 59,
    "navrattan_korma": 60,
    "palak_paneer": 61,
    "paneer_butter_masala": 62,
    "phirni": 63,
    "pithe": 64,
    "poha": 65,
    "poornalu": 66,
    "pootharekulu": 67,
    "qubani_ka_meetha": 68,
    "rabri": 69,
    "ras_malai": 70,
    "rasgulla": 71,
    "sandesh": 72,
    "shankarpali": 73,
    "sheer_korma": 74,
    "sheera": 75,
    "shrikhand": 76,
    "sohan_halwa": 77,
    "sohan_papdi": 78,
    "sutar_feni": 79
  },
  "layer_norm_eps": 1e-12,
  "model_type": "vit",
  "num_attention_heads": 12,
  "num_channels": 3,
  "num_hidden_layers": 12,
  "patch_size": 16,
  "problem_type": "single_label_classification",
  "qkv_bias": true,
  "torch_dtype": "float32",
  "transformers_version": "4.45.2"
}
